# Дополните приведенный код, используя списочный метод append(), чтобы список list1 имел вид:
#
# list1 = [10, 20, [300, 400, [5000, 6000, 7000], 500], 30, 40]

# list1 = [10, 20, [300, 400, [5000, 6000], 500], 30, 40]
# list1[2][2].append(7000)
#
# print(list1)
# ===================================

# Дополните приведенный код, используя списочный метод extend(), чтобы список list1 имел вид:
#
# list1 = ['a', 'b', ['c', ['d', 'e', ['f', 'g', 'h', 'i', 'j'], 'k'], 'l'], 'm', 'n']
# Подсписок для расширения  sub_list = ['h', 'i', 'j'].

# list1 = ['a', 'b', ['c', ['d', 'e', ['f', 'g'], 'k'], 'l'], 'm', 'n']
# sub_list = ['h', 'i', 'j']
# list1[2][1][2].extend(sub_list)
# print(list1)
# =======================================

# Дополните приведенный код, используя цикл for и встроенную функцию max(),
# чтобы он выводил максимальный элемент среди всех элементов вложенных списков списка list1.

# list1 = [[1, 7, 8], [9, 7, 102], [6, 106, 105], [100, 99, 98, 103], [1, 2, 3]]
# maximum = max([max(num) for num in list1])
#
# print(maximum)
# ====================================

# Дополните приведенный код так, чтобы список list1 имел вид:

# list1 = [[8, 7, 1], [102, 7, 9], [105, 106, 102], [103, 98, 99, 100], [3, 2, 1]]

# list1 = [[1, 7, 8], [9, 7, 102], [102, 106, 105], [100, 99, 98, 103], [1, 2, 3]]
# # for el in list1:
# #     el.reverse()
# # or
# [el.reverse() for el in list1]
#
# print(list1)
# ========================
#
# Дополните приведенный код так, чтобы он выводил единственное число: сумму всех чисел списка list1, разделённую на общее количество всех чисел.

# list1 = [[1, 7, 8], [9, 7, 102], [102, 106, 105], [100, 99, 98, 103], [1, 2, 3]]
# total = 0
# counter = 0
# total += sum([sum(el) for el in list1])
# counter += sum([len(el) for el in list1])
# print(total / counter)
